<template>
    <div class="content-editor">
        <Toolbar @update:imageUrl="updateImageUrl" />
      <editable-text v-model="content" class="text">
        Таким образом консультация с широким активом представляет собой интересный эксперимент проверки позиций, занимаемых участниками в отношении поставленных задач. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки форм развития. Идейные соображения высшего порядка, а также укрепление и развитие структуры влечет за собой процесс внедрения и модернизации соответствующий условий активизации. Задача организации, в особенности же реализация намеченных плановых заданий играет важную роль в формировании дальнейших направлений развития. Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании существенных финансовых и административных условий.      </editable-text>
      <editable-text v-model="title" class="title">
        Смотрите какие обезьянки
    </editable-text>
      <EditableImage v-model:imageUrl="imageUrl" />
      <editable-text v-model="content" class="text">
        Таким образом консультация с широким активом представляет собой интересный эксперимент проверки позиций, занимаемых участниками в отношении поставленных задач. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой инйцу шо шщйоц ущойц ущошцщйуо йцщуо йщцоу щйоу шщйцош ущйтересный эксперимент проверки форм развития. Идейные соображения высшего порядка, а также укрепление и развитие структуры влечет за собой процесс внедрения и модернизации соответствующий условий активизации. Задача организации, в особенности же реализация намеченных плановых заданий играет важную роль в формировании дальнейших направлений развития. Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании существенных финансовых и административных условий.

        Товарищи! новая модель организационной деятельности требуют от нас анализа направлений прогрессивного развития. Задача организации, в особенности же постоянный количественный рост и сфера нашей активности требуют от нас анализа позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же реализация намеченных плановых заданий требуют от нас анализа системы обучения кадров, соответствует насущным потребностям.      </editable-text>
    </div>
  </template>
  
  <script>
  import EditableText from './EditableText.vue';
  import EditableImage from './EditableImage.vue';
  import Toolbar from './Toolbar.vue';
  
  export default {
    components: {
      EditableText,
      EditableImage,
      Toolbar,
    },
    data() {
    return {
      title: '',
      content: '',
      imageUrl: 'src/assets/default-image.png',
    };
  },
  methods: {
    updateImageUrl(newUrl) {
      this.imageUrl = newUrl;
    },
  },
  };
  </script>

  <style scoped>
  .title{
    font-size: 31px;
    line-height: 23px;
    font-weight: 400;
  }
  .text {
    font-size: 15px;
  }
</style>